{"format": "graph-model", "generatedBy": "2.9.1", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"input_2": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}, "outputs": {"conv2d_transpose_15": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "32"}, {"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "46"}, {"size": "95"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "48"}, {"size": "99"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "50"}, {"size": "99"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "49"}, {"size": "98"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "49"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "47"}, {"size": "49"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_15/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "49"}, {"size": "49"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_15/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "49"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_14/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "49"}, {"size": "49"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "49"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/concatenate_7/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "49"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_13/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "50"}, {"size": "49"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_13/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "49"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/concatenate_8/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "49"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_12/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "49"}, {"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_12/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/concatenate_9/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_8/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "31"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "31"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_9/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "31"}, {"size": "42"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "42"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_10/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "42"}, {"size": "47"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_10/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_11/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "47"}, {"size": "49"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "49"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/concatenate_10/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/concatenate_11/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "46"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/concatenate_12/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/concatenate_13/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_7/LeakyRelu", "op": "_FusedConv2D", "input": ["input_2", "StatefulPartitionedCall/model_1_nota_nota/conv2d_8/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1_nota_nota/conv2d_8/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_8/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_7/LeakyRelu", "StatefulPartitionedCall/model_1_nota_nota/conv2d_9/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1_nota_nota/conv2d_9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_9/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_8/LeakyRelu", "StatefulPartitionedCall/model_1_nota_nota/conv2d_10/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1_nota_nota/conv2d_10/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_10/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_9/LeakyRelu", "StatefulPartitionedCall/model_1_nota_nota/conv2d_11/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1_nota_nota/conv2d_11/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_host_args": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_11/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_10/LeakyRelu", "StatefulPartitionedCall/model_1_nota_nota/conv2d_12/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1_nota_nota/conv2d_12/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_12/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_11/LeakyRelu", "StatefulPartitionedCall/model_1_nota_nota/conv2d_13/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1_nota_nota/conv2d_13/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_13/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_12/LeakyRelu", "StatefulPartitionedCall/model_1_nota_nota/conv2d_14/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1_nota_nota/conv2d_14/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/activation_8/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_13/LeakyRelu", "StatefulPartitionedCall/model_1_nota_nota/conv2d_15/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1_nota_nota/conv2d_15/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1_nota_nota/activation_8/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/Shape", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/strided_slice/stack", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/strided_slice/stack_1", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/strided_slice", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/stack/1", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/stack/2", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/stack", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1_nota_nota/activation_8/Relu"], "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/conv2d_transpose", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/concatenate_7/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_8/BiasAdd", "StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_13/LeakyRelu", "StatefulPartitionedCall/model_1_nota_nota/concatenate_7/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/activation_9/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1_nota_nota/concatenate_7/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1_nota_nota/activation_9/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/Shape", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/strided_slice/stack", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/strided_slice/stack_1", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/strided_slice", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/stack/1", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/stack/2", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/stack", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1_nota_nota/activation_9/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/conv2d_transpose", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/concatenate_8/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_9/BiasAdd", "StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_12/LeakyRelu", "StatefulPartitionedCall/model_1_nota_nota/concatenate_8/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/activation_10/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1_nota_nota/concatenate_8/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1_nota_nota/activation_10/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/Shape", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/strided_slice/stack", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/strided_slice/stack_1", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/strided_slice", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/stack/1", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/stack/2", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/stack", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1_nota_nota/activation_10/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/conv2d_transpose", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/concatenate_9/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_10/BiasAdd", "StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_11/LeakyRelu", "StatefulPartitionedCall/model_1_nota_nota/concatenate_9/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/activation_11/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1_nota_nota/concatenate_9/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1_nota_nota/activation_11/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/Shape", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/strided_slice/stack", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/strided_slice/stack_1", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/strided_slice", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/stack/1", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/stack/2", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/stack", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1_nota_nota/activation_11/Relu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/conv2d_transpose", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/concatenate_10/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_11/BiasAdd", "StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_10/LeakyRelu", "StatefulPartitionedCall/model_1_nota_nota/concatenate_10/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/activation_12/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1_nota_nota/concatenate_10/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1_nota_nota/activation_12/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/Shape", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/strided_slice/stack", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/strided_slice/stack_1", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/strided_slice", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/stack/1", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/stack/2", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/stack", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1_nota_nota/activation_12/Relu"], "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/conv2d_transpose", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/concatenate_11/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_9/LeakyRelu", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_12/BiasAdd", "StatefulPartitionedCall/model_1_nota_nota/concatenate_11/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/activation_13/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1_nota_nota/concatenate_11/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1_nota_nota/activation_13/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/Shape", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/strided_slice/stack", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/strided_slice/stack_1", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/strided_slice", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/stack/1", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/stack/2", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/stack", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1_nota_nota/activation_13/Relu"], "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/conv2d_transpose", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/concatenate_12/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_8/LeakyRelu", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_13/BiasAdd", "StatefulPartitionedCall/model_1_nota_nota/concatenate_12/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/activation_14/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1_nota_nota/concatenate_12/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1_nota_nota/activation_14/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/Shape", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/strided_slice/stack", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/strided_slice/stack_1", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/strided_slice", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/stack/1", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/stack/2", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/stack", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1_nota_nota/activation_14/Relu"], "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/conv2d_transpose", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/concatenate_13/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1_nota_nota/leaky_re_lu_7/LeakyRelu", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_14/BiasAdd", "StatefulPartitionedCall/model_1_nota_nota/concatenate_13/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/activation_15/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1_nota_nota/concatenate_13/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1_nota_nota/activation_15/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/Shape", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/strided_slice/stack", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/strided_slice/stack_1", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/strided_slice", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/stack/1", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/stack/2", "StatefulPartitionedCall/model_1_nota_nota/conv2d_transpose_15/stack/3"], "attr": {"T": 