{"format": "graph-model", "generatedBy": "2.9.1", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"input_2": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}, "outputs": {"conv2d_transpose_15": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "32"}, {"size": "127"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "177"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "92"}, {"size": "187"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "94"}, {"size": "186"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "92"}, {"size": "185"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "93"}, {"size": "184"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "92"}, {"size": "94"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_15/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "92"}, {"size": "94"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_15/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "94"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_14/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "92"}, {"size": "92"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/concatenate_7/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "93"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_13/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "94"}, {"size": "92"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_13/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/concatenate_8/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_12/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "93"}, {"size": "94"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_12/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "94"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/concatenate_9/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "94"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_8/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_9/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "32"}, {"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_10/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "63"}, {"size": "85"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_10/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "85"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_11/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "85"}, {"size": "93"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "93"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/concatenate_10/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/concatenate_11/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/concatenate_12/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/concatenate_13/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/model_1_nota/leaky_re_lu_7/LeakyRelu", "op": "_FusedConv2D", "input": ["input_2", "StatefulPartitionedCall/model_1_nota/conv2d_8/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1_nota/conv2d_8/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_host_args": {"i": "0"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1_nota/leaky_re_lu_8/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1_nota/leaky_re_lu_7/LeakyRelu", "StatefulPartitionedCall/model_1_nota/conv2d_9/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1_nota/conv2d_9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "use_cudnn_on_gpu": {"b": true}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_1_nota/leaky_re_lu_9/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1_nota/leaky_re_lu_8/LeakyRelu", "StatefulPartitionedCall/model_1_nota/conv2d_10/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1_nota/conv2d_10/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "num_host_args": {"i": "0"}, "leakyrelu_alpha": {"f": 0.2}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_1_nota/leaky_re_lu_10/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1_nota/leaky_re_lu_9/LeakyRelu", "StatefulPartitionedCall/model_1_nota/conv2d_11/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1_nota/conv2d_11/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_1_nota/leaky_re_lu_11/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1_nota/leaky_re_lu_10/LeakyRelu", "StatefulPartitionedCall/model_1_nota/conv2d_12/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1_nota/conv2d_12/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"TArgs": {"list": {"type": ["DT_FLOAT"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_1_nota/leaky_re_lu_12/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1_nota/leaky_re_lu_11/LeakyRelu", "StatefulPartitionedCall/model_1_nota/conv2d_13/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1_nota/conv2d_13/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_host_args": {"i": "0"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1_nota/leaky_re_lu_13/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1_nota/leaky_re_lu_12/LeakyRelu", "StatefulPartitionedCall/model_1_nota/conv2d_14/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1_nota/conv2d_14/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "num_host_args": {"i": "0"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "leakyrelu_alpha": {"f": 0.2}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1_nota/activation_8/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1_nota/leaky_re_lu_13/LeakyRelu", "StatefulPartitionedCall/model_1_nota/conv2d_15/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1_nota/conv2d_15/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "leakyrelu_alpha": {"f": 0.2}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "filter_format": {"s": "SFdJTw=="}, "num_host_args": {"i": "0"}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1_nota/activation_8/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/Shape", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/strided_slice/stack", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/strided_slice/stack_1", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/strided_slice", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/stack/1", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/stack/2", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/stack", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1_nota/activation_8/Relu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/conv2d_transpose", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_1_nota/concatenate_7/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_8/BiasAdd", "StatefulPartitionedCall/model_1_nota/leaky_re_lu_13/LeakyRelu", "StatefulPartitionedCall/model_1_nota/concatenate_7/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/activation_9/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1_nota/concatenate_7/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1_nota/activation_9/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/Shape", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/strided_slice/stack", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/strided_slice/stack_1", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/strided_slice", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/stack/1", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/stack/2", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/stack", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1_nota/activation_9/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/conv2d_transpose", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_1_nota/concatenate_8/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_9/BiasAdd", "StatefulPartitionedCall/model_1_nota/leaky_re_lu_12/LeakyRelu", "StatefulPartitionedCall/model_1_nota/concatenate_8/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/activation_10/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1_nota/concatenate_8/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1_nota/activation_10/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/Shape", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/strided_slice/stack", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/strided_slice/stack_1", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/strided_slice", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/stack/1", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/stack/2", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/stack", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1_nota/activation_10/Relu"], "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/conv2d_transpose", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/concatenate_9/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_10/BiasAdd", "StatefulPartitionedCall/model_1_nota/leaky_re_lu_11/LeakyRelu", "StatefulPartitionedCall/model_1_nota/concatenate_9/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/activation_11/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1_nota/concatenate_9/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1_nota/activation_11/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/Shape", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/strided_slice/stack", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/strided_slice/stack_1", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/strided_slice", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/stack/1", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/stack/2", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/stack", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1_nota/activation_11/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/conv2d_transpose", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/concatenate_10/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_11/BiasAdd", "StatefulPartitionedCall/model_1_nota/leaky_re_lu_10/LeakyRelu", "StatefulPartitionedCall/model_1_nota/concatenate_10/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/activation_12/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1_nota/concatenate_10/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1_nota/activation_12/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/Shape", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/strided_slice/stack", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/strided_slice/stack_1", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/strided_slice", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/stack/1", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/stack/2", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/stack", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1_nota/activation_12/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/conv2d_transpose", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/concatenate_11/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1_nota/leaky_re_lu_9/LeakyRelu", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_12/BiasAdd", "StatefulPartitionedCall/model_1_nota/concatenate_11/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_1_nota/activation_13/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1_nota/concatenate_11/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1_nota/activation_13/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/Shape", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/strided_slice/stack", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/strided_slice/stack_1", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/strided_slice", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/stack/1", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/stack/2", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/stack", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1_nota/activation_13/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/conv2d_transpose", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/concatenate_12/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1_nota/leaky_re_lu_8/LeakyRelu", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_13/BiasAdd", "StatefulPartitionedCall/model_1_nota/concatenate_12/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/activation_14/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1_nota/concatenate_12/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1_nota/activation_14/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/Shape", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/strided_slice/stack", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/strided_slice/stack_1", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/strided_slice", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/stack/1", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/stack/2", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/stack", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1_nota/activation_14/Relu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/conv2d_transpose", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/concatenate_13/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1_nota/leaky_re_lu_7/LeakyRelu", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_14/BiasAdd", "StatefulPartitionedCall/model_1_nota/concatenate_13/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/activation_15/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1_nota/concatenate_13/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1_nota/activation_15/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/Shape", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/strided_slice/stack", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/strided_slice/stack_1", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/strided_slice", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/stack/1", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/stack/2", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/stack", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1_nota/activation_15/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/conv2d_transpose", "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_1_nota/conv2d_transpose_15/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], 